chirping78/lpc177x_8x/Examples/EMAC/InternetRadio/lpc177x_8x_port/decoder_1.c
    return n_wbytes;
}

/*********************************************************************//**
 * @brief       Read data from audio buffer
 * @param[in]   Audio Buffer, buffer pointer and buffer size.
 * @return      The number of read bytes.
 **********************************************************************/
uint32_t AudioBuf_Read(AUDIO_BUFFER *buff, uint8_t* data, uint32_t size)
{
    int n_rbytes = __AUDIO_BUFF_NUM(buff);
    
    if(n_rbytes > size)
        n_rbytes = size;
    memcpy(data, &buff->buffer[buff->head], n_rbytes);
    __BUF_INCR_NUM(buff->head, n_rbytes, buff->buffer_size);
 
    return n_rbytes;
}
/*********************************************************************//**
 * @brief       Playback setup
 * @param[in]   none
 * @return      None
 **********************************************************************/
Status Play_Setup(void)
{
    I2S_CFG_Type I2S_SetupStruct;
    I2S_MODEConf_Type I2S_ClkConfig;
#if DMA_USED    
    I2S_DMAConf_Type I2S_DMAStruct;
#endif    
    uint32_t samplerate = 0;
    if(play_setup_stat)
        return SUCCESS;  
    
    _DBG_("[DEBUG]Mp3 frame info:");
    _DBG("[DEBUG]Wordwidth = ");_DBD(mp3_frame_info.bitsPerSample);_DBG_("");
    _DBG("[DEBUG]Channels = ");_DBD(mp3_frame_info.nChans);_DBG_("");
    _DBG("[DEBUG]Sample Rate = ");_DBD32(mp3_frame_info.samprate);_DBG_("");
    switch(mp3_frame_info.version)
    {
        case MPEG1:
            _DBG("[DEBUG]Version = MPEG1");
            break;
        case MPEG2:
            _DBG("[DEBUG]Version = MPEG2");
            break;
        case MPEG25:
            _DBG("[DEBUG]Version = MPEG2.5");
            break;
        default:
            _DBG_("[DEBUG]Unsupported version.");
            return ERROR;
    }
    _DBG(" layer ");_DBD(mp3_frame_info.layer);_DBG_("");
    _DBG("[DEBUG]Bitrate = ");_DBD32(mp3_frame_info.bitrate);_DBG_("");
    
    /* Audio Config*/
    if(mp3_frame_info.bitsPerSample == 8)
        I2S_SetupStruct.wordwidth = I2S_WORDWIDTH_8;
    else if (mp3_frame_info.bitsPerSample == 16)
        I2S_SetupStruct.wordwidth = I2S_WORDWIDTH_16;
    else if (mp3_frame_info.bitsPerSample == 32)
        I2S_SetupStruct.wordwidth = I2S_WORDWIDTH_32;
    else
        goto setup_err;
    if(mp3_frame_info.nChans == 1)
        I2S_SetupStruct.mono = I2S_MONO;
    else if (mp3_frame_info.nChans == 2)
        I2S_SetupStruct.mono = I2S_STEREO;
    else
        goto setup_err;
    I2S_SetupStruct.stop = I2S_STOP_ENABLE;
    I2S_SetupStruct.reset = I2S_RESET_ENABLE;
    I2S_SetupStruct.ws_sel = I2S_MASTER_MODE;
    I2S_SetupStruct.mute = I2S_MUTE_DISABLE;
    I2S_Config(LPC_I2S,I2S_TX_MODE,&I2S_SetupStruct);

    /* Clock Mode Config*/
    I2S_ClkConfig.clksel = I2S_CLKSEL_FRDCLK;
    I2S_ClkConfig.fpin = I2S_4PIN_DISABLE;
    I2S_ClkConfig.mcena = I2S_MCLK_ENABLE;
    I2S_ModeConfig(LPC_I2S,&I2S_ClkConfig,I2S_TX_MODE);
             

    if(mp3_frame_info.nChans == 1)
        samplerate = mp3_frame_info.samprate*2;
    else
        samplerate = mp3_frame_info.samprate;
    if( samplerate > 96000)
        goto setup_err;
    if(I2S_FreqConfig(LPC_I2S, samplerate, I2S_TX_MODE) != SUCCESS)
        goto setup_err;
    
    I2S_Stop(LPC_I2S, I2S_TX_MODE);

    /* TX FIFO depth is 4 */
    I2S_IRQConfig(LPC_I2S,I2S_TX_MODE,4);
    I2S_IRQCmd(LPC_I2S,I2S_TX_MODE,ENABLE);
    
    Uda1380_Init(100000, mp3_frame_info.samprate, mp3_frame_info.nChans);
    Uda1380_MasterVolCtrl(0xB4,0xB4);
    _DBG_("[DEBUG]I2S configured.");
 
#if DMA_USED
    GPDMA_Init();
	/*
	 * Configure GPDMA channel 0 -------------------------------------------------------------
	 * Used for I2S Transmit
	 */
	// Setup GPDMA channel --------------------------------
	// channel 0
	GPDMACfg.ChannelNum = 0;
	// Source memory
	GPDMACfg.SrcMemAddr = 0;
	// Destination memory
	GPDMACfg.DstMemAddr = 0;
	// Transfer size
	GPDMACfg.TransferSize = 0;
	// Transfer width - unused
	GPDMACfg.TransferWidth = 0;
	// Transfer type
	GPDMACfg.TransferType = GPDMA_TRANSFERTYPE_M2P;
	// Source connection
	GPDMACfg.SrcConn = 0;
	// Destination connection - unused
	GPDMACfg.DstConn = GPDMA_CONN_I2S_Channel_0;
	// Linker List Item - unused
	GPDMACfg.DMALLI = 0;
	GPDMA_Setup(&GPDMACfg);
    
    I2S_DMAStruct.DMAIndex = I2S_DMA_1;
	I2S_DMAStruct.depth = 1;
	I2S_DMAConfig(LPC_I2S, &I2S_DMAStruct, I2S_TX_MODE);
	I2S_DMACmd(LPC_I2S, I2S_DMA_1, I2S_TX_MODE, ENABLE);
    
	/* Setting GPDMA interrupt */
    // Disable interrupt for DMA
    NVIC_DisableIRQ (DMA_IRQn);
    /* preemption = 1, sub-priority = 1 */
    NVIC_SetPriority(DMA_IRQn, 0x01);
    /* Enable interrupt for DMA */
	NVIC_EnableIRQ (DMA_IRQn);
#endif    
    I2S_Start(LPC_I2S);
    play_setup_stat = 1;
    return SUCCESS;
    
setup_err:
#if ERROR_LOG
    _DBG_("[DEBUG]I2S Setup error!!!");
#endif    
    return ERROR;
}
/*********************************************************************//**
 * @brief       Start/Stop playback
 * @param[in]   0: stop, 1: start
 * @return      None
 **********************************************************************/
void Play_Control(uint8_t start)
{
    static volatile uint8_t inFunc = 0;
    if(inFunc)
        return;
    inFunc = 1;
    do
    {
        if(start)
        {
            if((play_int_stat == SET) ||
                (AUDIO_BUFF_SIZE/2 > __AUDIO_BUFF_NUM(&audio_buffer)))
                break;        
            play_int_stat = SET;
        
            if(Play_Setup() == SUCCESS)
            {
#if DMA_USED            
                DMA_Send();
#else
                I2S_Start(LPC_I2S);
                NVIC_EnableIRQ(I2S_IRQn);
#endif            
            }
        }
        else
        {
            if(play_int_stat == RESET)
                break;
            
            play_int_stat = RESET;
        
#if !DMA_USED    
            NVIC_DisableIRQ(I2S_IRQn);
            I2S_Stop(LPC_I2S, I2S_TX_MODE);
#endif    
#if ERROR_LOG 
        {        
            clock_time_t cur_ticks = clock_time();
            _DBD32(cur_ticks);_DBG_(": Play so fast!!!");
        }
#endif    
        }
    }while(0);
    inFunc = 0;
}
/*----------------- INTERRUPT SERVICE ROUTINES --------------------------*/
#if DMA_USED
/*********************************************************************//**
 * @brief		GPDMA interrupt handler sub-routine
 * @param[in]	None
 * @return 		None
 **********************************************************************/
void DMA_IRQHandler (void)
{
	// check GPDMA interrupt on channel 0
	if (GPDMA_IntGetStatus(GPDMA_STAT_INT, 0)){ //check interrupt status on channel 0
		// Check counter terminal status
		if(GPDMA_IntGetStatus(GPDMA_STAT_INTTC, 0)){
			// Clear terminate counter Interrupt pending
			GPDMA_ClearIntPending (GPDMA_STATCLR_INTTC, 0); 
#if DEBUG_DATA_READ   
            {
                clock_time_t cur_ticks = clock_time();
                if(rsamples_cnt == -1)
                {
                    rticks_1s = cur_ticks;
                    rsamples_cnt = 0;
                }
                
                rsamples_cnt += mp3_frame_info.outputSamps*((play_dma_size*4)/audio_frame_size)/mp3_frame_info.nChans;
                if (cur_ticks >= (rticks_1s + 10*CLOCK_CONF_SECOND))
                {
                    _DBG("Read: ");_DBD32(((uint64_t)rsamples_cnt*CLOCK_CONF_SECOND)/(cur_ticks - rticks_1s ));_DBG_("samples/s");
                    rticks_1s = clock_time();
                    rsamples_cnt = 0;
                }
            }
#endif           
            play_dma_size = 0;  
            DMA_Send();
		}
		// Check error terminal status
		if (GPDMA_IntGetStatus(GPDMA_STAT_INTERR, 0)){
			// Clear error counter Interrupt pending
			GPDMA_ClearIntPending (GPDMA_STATCLR_INTERR, 0);
            __BUF_INCR_NUM(audio_buffer.head,play_dma_size*4,audio_buffer.buffer_size) ;
            play_dma_size = 0;
#if ERROR_LOG
            _DBG_("DMA Error!!!");
#endif            
            DMA_Send();
		}
	}
	
